after/app/forms_object/password_form.rb

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "123456"], ["updated_at", "2018-05-29 17:04:34.517308"], ["id", 6]]
---
  def submit?(params)
    self.original_password = params[:original_password]
    self.new_password = params[:new_password]
    self.new_password_confirmation = params[:new_password_confirmation]

    if valid?
      @user.password = new_password
      @user.save!