after/app/forms_object/signup_form.rb

  def submit?(params)
    @user.attributes = params

    if(valid?)
      @user.save!
---
INSERT INTO "users" ("email", "password", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "admin@example.com"], ["password", "12"], ["username", "admin2"], ["created_at", "2018-05-29 17:01:59.585320"], ["updated_at", "2018-05-29 17:01:59.585320"]]

  def verify_uniqueness_username
    if User.exists? username: username
---
SELECT  1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "admin2"], ["LIMIT", 1]]