before/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "admin@example.com"], ["password", "123456"], ["username", "admin"], ["created_at", "2018-05-29 15:26:34.520076"], ["updated_at", "2018-05-29 15:26:34.520076"]]